In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 1.1 MB/s eta 0:00:011
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [2]:
import pymysql

In [12]:
#MySQl Connection

conn=pymysql.connect(host="127.0.0.1",user="root",passwd="qwer1234",db="education",charset="utf8")

In [13]:
curs=conn.cursor()
sql="select * from student"
curs.execute(sql)

6

In [14]:
# Data Fetch
rows=curs.fetchall()
print(rows)

(('S001', '박소명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None))

# select의 내용을 dataframe으로 보기

In [6]:
!pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.8/site-packages (1.0.2)

In [7]:
import pandas as pd
from sqlalchemy import create_engine

In [22]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/education?", convert_unicode=True)
conn = engine.connect()

In [11]:
data = pd.read_sql_table('student', conn)
data

  scode sname   sdept    sphone saddress
0  S001   박소명  컴퓨터공학과  123-4567     None
1  S002   최민국  컴퓨터공학과  234-5678     None
2  S003   이승호    국문학과  345-6789     None
3  S004   정수봉    국문학과  456-7890     None
4  S005   김상진     사학과  567-8901     None
5  S006   황정숙     사학과  678-9012     None

# dataFrame을 Database로 Insert하기

In [25]:
column = ['rank',"title"]
movies = pd.read_csv("./Data/DaumList.csv")
movies.columns = column
movies.head()

   rank        title
0     1       블랙 위도우
1     2         발신제한
2     3         크루엘라
3     4  콰이어트 플레이스 2
4     5           랑종

In [26]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum?", convert_unicode=True)
conn = engine.connect()

In [27]:
movies.to_sql(name='daumlist', con=engine, if_exists='append', index=False)

In [28]:
column = ['rank','rating',"title",'review']
movies = pd.read_csv("./Data/RottenTomatoesLists.csv")
movies.columns = column
movies.head()

   rank rating                           title  review
0   1.0    98%  Parasite (Gisaengchung) (2019)     459
1   2.0    94%        Avengers: Endgame (2019)     542
2   3.0    97%               Knives Out (2019)     464
3   4.0    93%                       Us (2019)     551
4   5.0    97%              Toy Story 4 (2019)     451

In [29]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1:3306/daum?", convert_unicode=True)
conn = engine.connect()

In [30]:
movies.to_sql(name='new_table', con=engine, if_exists='append', index=False)